testCases/Cavity/Ye/semi-analytical-comparison/cavity_stoich_ideal/system/controlDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         mapFoam;

startFrom           latestTime;

startTime           0;

stopAt              endTime;

endTime             2000;

deltaT              1e-8;

writeControl        adjustableRunTime;

writeInterval       50;

purgeWrite          2;

writeFormat         ascii;

writePrecision      6;

writeCompression    uncompressed;

timeFormat          general;

timePrecision       6;

adjustTimeStep      yes;

maxCo               1e-12;

runTimeModifiable   yes;

functions
{
    probes
    {
        // Where to load it from
        libs ( "libsampling.so" );

        type            probes;

        // Name of the directory for probe data
        name            probes;

        // Write at same frequency as fields
        writeControl    writeTime;
        writeInterval   1;

        // Fields to be probed
        fields
        (
            Ct_PO4 Ct_NH4 Ct_MG Ct_MAP 
            C_PO4 C_NH4 C_MG C_MAP 
            SI SR S Sa relS nucleationSource
        );

        probeLocations
        (
            ( 0.05 0.05 0.005 )
        );
    }
}


// ************************************************************************* //
